Wikitutorials/tutorials/multiphase/multiphaseEulerFoam/laminar/titaniaSynthesis/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 1;
    }

    aggregates
    {
        nCorr                1;
        tolerance            1e-4;
        scale                true;
        sourceUpdateInterval 10;
        solveOnFinalIterOnly false;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
        maxIter         20;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(h|e).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
        maxIter         10;
    }

    "(k|epsilon).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;
        relTol          0;
        minIter         1;
    }

    "(Yi|f|kappa).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
        residualAlpha   1e-5;
        minIter         1;
    }
}

PIMPLE
{
    nOuterCorrectors    1;
    nCorrectors         1;
    nEnergyCorrectors   1;
    nNonOrthogonalCorrectors 0;
    faceMomentum        yes;
}

relaxationFactors
{
    equations
    {
        ".*"                          1.0;
    }
}


// ************************************************************************* //
